Revit 2024 API
Transform2D.IsTranslation Property
 The boolean value that indicates whether this transformation is a translation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public bool IsTranslation { get; }
Visual Basic
Public ReadOnly Property IsTranslation As Boolean
	Get
Visual C++
public:
property bool IsTranslation {
	bool get ();
}
Remarks
 This property is true if the only effect of transformation is translation. It checks that the linear part of the transform is identity. The translation vector may be zero (which would make this an identity transformation) or nonzero (which would make this a non-trivial translation).
See Also
Transform2D Class
Autodesk.Revit.DB Namespace